Repository: daniele-athome/airborne
Catalog: lib/l10n/app_*.arb
Languages: it

# dialog_button_cancel
source: Cancel
it: Annulla

# dialog_button_done
source: Done
it: Chiudi

# dialog_title_error
source: Error
it: Errore

# mainNav_bookFlight
source: Bookings
it: Prenota

# button_goToday
source: Today
it: Oggi

# button_bookFlight
source: Book
it: Prenota

# button_logFlight
source: Log flight
it: Registra volo

# error_generic_network_timeout
source: Server did not respond.
it: Il server non risponde.

# bookFlight_view_schedule
source: Schedule
it: Agenda

# bookFlight_view_month
source: Month
it: Mese

# bookFlight_view_week
source: Week
it: Settimana

# bookFlight_view_day
source: Day
it: Giorno

# bookFlight_span_days
source: Day {current} / {total}
it: Giorno {current} / {total}

# bookFlight_button_error_retry
source: Retry
it: Riprova

# bookFlight_message_flight_added
source: Flight booked successfully.
it: Prenotazione effettuata.

# bookFlight_message_flight_canceled
source: Flight canceled successfully.
it: Prenotazione cancellata.

# bookFlight_message_flight_updated
source: Flight saved successfully.
it: Prenotazione modificata.

# bookFlightModal_title_create
source: Book flight
it: Prenota

# bookFlightModal_title_edit
source: Edit
it: Modifica

# bookFlightModal_button_save
source: Save
it: Salva

# bookFlightModal_button_close
source: Close
it: Chiudi

# bookFlightModal_button_delete
source: Delete
it: Elimina

# bookFlightModal_label_pilot
source: Pilot
it: Pilota

# bookFlightModal_label_start
source: Start
it: Inizio

# bookFlightModal_label_end
source: End
it: Fine

# bookFlightModal_hint_notes
source: Notes
it: Note

# bookFlightModal_error_notOwnBooking_edit
source: Flight is not yours, you cannot modify it.
it: La prenotazione non è tua, non puoi modificarla.

# bookFlightModal_error_notOwnBooking_delete
source: Flight is not yours, you cannot delete it.
it: La prenotazione non è tua, non puoi cancellarla.

# bookFlightModal_error_bookingForOthers
source: You can't book flight for another pilot.
it: Non puoi prenotare voli per un altro pilota.

# bookFlightModal_error_timeConflict
source: Another flight is already booked for this time slot!
it: Un'altra prenotazione è già presente per l'orario indicato!

# bookFlightModal_dialog_changePilot_title
source: Change pilot?
it: Cambiare pilota?

# bookFlightModal_dialog_changePilot_message
source: You are changing the pilot for this flight.
it: Stai cambiando il pilota di una prenotazione.

# bookFlightModal_dialog_working
source: Please wait...
it: Un attimo...

# bookFlightModal_dialog_delete_title
source: Delete?
it: Cancellare?

# bookFlightModal_dialog_delete_message
source: Do not delete flights booked by others without the pilot knowing.
it: Non cancellare prenotazioni altrui senza il consenso del pilota.

# bookFlightModal_dialog_selectPilot
source: Select pilot
it: Seleziona pilota

# flightLog_message_flight_added
source: Flight registered successfully.
it: Volo registrato.

# flightLog_message_flight_canceled
source: Flight deleted successfully.
it: Volo cancellato.

# flightLog_message_flight_updated
source: Flight saved successfully.
it: Volo modificato.

# flightLog_button_error_retry
source: Retry
it: Riprova

# flightLog_error_noItemsFound
source: No registered flights.
it: Nessun volo registrato.

# flightLog_error_firstPageIndicator
source: Something went wrong.
it: Qualcosa è andato storto.

# flightLog_error_newPageIndicator
source: Something went wrong. Tap to retry.
it: Qualcosa è andato storto. Tocca per riprovare.

# flightLogModal_title_create
source: Log flight
it: Registra

# flightLogModal_title_edit
source: Edit flight
it: Modifica

# flightLogModal_button_save
source: Save
it: Salva

# flightLogModal_button_close
source: Close
it: Chiudi

# flightLogModal_button_delete
source: Delete
it: Elimina

# flightLogModal_label_date
source: Date
it: Data

# flightLogModal_label_pilot
source: Pilot
it: Pilota

# flightLogModal_label_startHour
source: Hour meter start
it: Orametro inizio

# flightLogModal_label_endHour
source: Hour meter end
it: Orametro fine

# flightLogModal_label_origin
source: Origin
it: Partenza

# flightLogModal_label_destination
source: Destination
it: Arrivo

# flightLogModal_label_home
source: Home
it: Casa

# flightLogModal_label_fuel_material
source: Fuel
it: Benzina

# flightLogModal_hint_fuel_material
source: liters
it: litri

# flightLogModal_label_fuel_cupertino
source: Fuel (liters)
it: Benzina (litri)

# flightLogModal_label_fuel_price_cupertino
source: Fuel price
it: Prezzo benzina

# flightLogModal_hint_notes
source: Notes
it: Note

# flightLogModal_dialog_selectPilot
source: Select pilot
it: Seleziona pilota

# flightLogModal_error_fuel_invalid_number
source: Invalid number
it: Numero non valido

# flightLogModal_error_notOwnFlight_delete
source: Flight is not yours, you cannot delete it.
it: Il volo non è tuo, non puoi cancellarlo.

# flightLogModal_error_invalid_hourmeter
source: Invalid hour meter.
it: Orametro non valido.

# flightLogModal_error_invalid_locations
source: Please provide origin and destination of flight.
it: Inserisci partenza e arrivo del volo.

# flightLogModal_error_invalid_fuel
source: Invalid fuel quantity.
it: Quantità di benzina non valida.

# flightLogModal_error_notOwnFlight_edit
source: Flight is not yours, you cannot modify it.
it: Il volo non è tuo, non puoi modificarlo.

# flightLogModal_error_alteringTestFlight
source: This is a test flight, you cannot change the pilot.
it: Il volo è una prova tecnica, non puoi cambiare pilota.

# flightLogModal_dialog_changePilot_title
source: Change pilot?
it: Cambiare pilota?

# flightLogModal_dialog_changePilot_message
source: You are changing the pilot of a registered flight.
it: Stai cambiando il pilota di un volo registrato.

# flightLogModal_dialog_changePilotNoPilot_message
source: You are turning this flight into a test flight.
it: Stai trasformando il volo in una prova tecnica.

# flightLogModal_error_loggingForOthers
source: You can't log flights for other pilots.
it: Non puoi registrare voli di un altro pilota.

# flightLogModal_dialog_delete_title
source: Delete?
it: Cancellare?

# flightLogModal_dialog_delete_message
source: You are deleting a registered flight. You won't be able to undo this!
it: Stai cancellando un volo registrato. Non potrai recuperarlo!

# flightLogModal_dialog_working
source: Please wait...
it: Un attimo...

# addAircraft_title
source: Setup aircraft
it: Configura aereo

# addAircraft_text1
source: Please type in the address to the aircraft data and its password.
it: Inserisci l'indirizzo della configurazione dell'aereo e la sua password.

# addAircraft_label_address
source: Address
it: Indirizzo

# addAircraft_hint_address
source: Aircraft data address
it: Indirizzo aereo

# addAircraft_button_install
source: Install
it: Installa

# addAircraft_dialog_downloading
source: Downloading...
it: Download in corso...

# addAircraft_error_invalid_address
source: Please insert a valid address
it: Inserisci un indirizzo valido

# addAircraft_error_storing
source: Unable to store aircraft data file.
it: Errore durante l'installazione dell'aereo.

# addAircraft_error_invalid_datafile
source: Not a valid aircraft data file.
it: Configurazione dell'aereo non valida.

# pilotSelect_title
source: Who are you?
it: Chi sei?

# pilotSelect_confirm_title
source: Confirm?
it: Confermi?

# pilotSelect_confirm_message
source: So you are {name}.
it: Dici di essere {name}.

# about_aircraft_info
source: Aircraft
it: Aeromobile

# about_aircraft_callsign
source: Call Sign
it: Marche

# about_aircraft_hangar_open_maps
source: Open in maps
it: Apri in mappe

# about_aircraft_pilots
source: Pilots
it: Piloti

# about_app_version
source: Version
it: Versione

# about_app_homepage
source: Source code
it: Codice sorgente

# about_app_homepage_subtitle
source: Go to the app source code
it: Vai al codice sorgente dell'app

# about_app_issues
source: Report issue
it: Segnala problema

# about_app_issues_subtitle
source: Open a bug to report an issue with the app
it: Apri un bug per segnalare un problema con l'app

# about_app_update_aircraft
source: Update aircraft
it: Aggiorna aereo

# about_app_update_aircraft_subtitle
source: Update aircraft data from network
it: Aggiorna i dati dell'aereo dalla rete

# about_app_disconnect_aircraft
source: Disconnect aircraft
it: Disconnetti aereo

# about_app_disconnect_aircraft_subtitle
source: For switching to another aircraft or download aircraft data again
it: Per cambiare aereo e riscaricare i dati

# about_update_password_title
source: Update aircraft
it: Aggiorna aereo

# about_update_password_message
source: Leave empty if a password is not needed.
it: Lascia vuota la password se non serve.

# about_disconnect_confirm_title
source: Disconnect aircraft?
it: Disconnettere l'aereo?

# about_disconnect_confirm_message
source: You will need to provide aircraft data address again.
it: Dovrai immettere di nuovo l'indirizzo dei dati dell'aereo.
